#### Terraform working directory 🏠: `demo/demo-account/demo-application/ec2`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instances.module.ec2_instance["test-host"].aws_ebs_volume.this["sdf"] will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = (known after apply)
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = 1000
      + kms_key_id        = (known after apply)
      + size              = 50
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "test-host/sdf"
        }
      + tags_all          = {
          + "Name" = "test-host/sdf"
        }
      + throughput        = (known after apply)
      + type              = "io1"
    }

  # module.ec2_instances.module.ec2_instance["test-host"].aws_eip_association.this[0] will be created
  + resource "aws_eip_association" "this" {
      + allocation_id        = "eipalloc-00a221db0ea3515af"
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.ec2_instances.module.ec2_instance["test-host"].aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0896ef7bec0d0e792"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = true
      + ebs_optimized                        = true
      + get_password_data                    = false
      + hibernation                          = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "EC2-test-role"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = "stop"
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = 0
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = 0
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = false
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-021332a665a8c3a0b"
      + tags                                 = {
          + "Name"     = "test-host"
          + "test-tag" = "little kitty eat 2 cookies"
        }
      + tags_all                             = {
          + "Name"     = "test-host"
          + "test-tag" = "little kitty eat 2 cookies"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "fce3b73ddd598c4b9569bc56b83c2d125384e119"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-05c1a83e3ad3d16db",
        ]

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "test-host/root"
            }
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.ec2_instances.module.ec2_instance["test-host"].aws_volume_attachment.this["sdf"] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "sdf"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
